{
    "title": "Michael Felipe Corrales Flórez - Portfolio",
    "name": "Michael Felipe Corrales Flórez",
    "profession": "Systems Engineer",
    "email": "📧 mfcorrales26@gmail.com",
    "phone": "📱 310 622 6041",
    "linkedin": "🔗 LinkedIn",
    "portfolio": "🌐 Portfolio",
    "github": "💻 GitHub",
    "downloadCV": "📄 Download CV",
    "intro": "I am a Systems Engineer with experience in web development, data analysis, and cybersecurity. I specialize in transforming data into valuable information through ETL processes, automation, and data visualization with interactive dashboards. I have knowledge in web application development using technologies such as React, Node.js, and Vue.js, as well as management of relational and non-relational databases (PostgreSQL, MySQL, advanced SQL), including modeling, advanced queries, and trigger usage. I have experience in implementing computer control and security systems, as well as personal data protection, training teams, and optimizing processes to mitigate risks. Additionally, I have skills in using development tools such as Git and GitHub for version control and repository management.",
    "education": "Education",
    "experience": "Professional Experience",
    "certifications": "Certifications",
    "technicalSkills": "Technical Skills",
    "additionalSkills": "Additional Skills",
    "systemsEngineering": "Systems Engineering",
    "oct2024": "October 2024",
    "universityPamplona": "University of Pamplona, Villa del Rosario – Norte de Santander",
    "engineeringDescription": "The Systems Engineering program at the University of Pamplona focuses on training well-rounded professionals capable of designing, developing, and implementing innovative technological solutions to solve problems across various sectors. Through an updated and relevant curriculum, students acquire knowledge and skills in key areas such as: Software Development, Data Management, Artificial Intelligence, and Cybersecurity.",
    "thesis": "Thesis: Guidelines for the efficient use of Artificial Intelligence tools in Colombian companies.",
    "dataMiningDiploma": "Diploma in Intelligent Data Mining and Systems Security",
    "dataMiningDescription": "Trains specialists in advanced data analysis and cybersecurity, combining data mining, machine learning, and information protection.",
    "dataProtectionDiploma": "Diploma in Personal Data Protection and Cybersecurity",
    "july2025": "July 2025 (10 weeks)",
    "universityJaveriana": "Javeriana University of Cali, Colombia",
    "dataProtectionDescription": "Focused on Colombian regulations and process optimization to ensure compliance in data protection.",
    "highSchool": "High School - Accounting Assistant Technician",
    "nov2016": "November 2016",
    "highSchoolName": "Minuto de Dios Policarpa Salavarrieta, Cúcuta – Norte de Santander",
    "dataAnalyst": "Data Analyst",
    "jan2024Feb2025": "January 2024 – February 2025",
    "foundationPro": "Pro-Regiones Colombia Foundation, San Juan de Pasto, Colombia",
    "dataAnalystDuties": [
      "Created statistical reports on the progress of internal processes within the organization.",
      "Documented each process in detail, optimizing information traceability.",
      "Used Excel and other advanced technological resources for report generation.",
      "Administered and managed SQL databases, performing queries, updates, and information maintenance.",
      "Designed and optimized SQL queries for data extraction and analysis.",
      "Performed preventive and corrective maintenance on company equipment and systems.",
      "Provided technical support and assistance in optimizing technological and operational processes.",
      "Created interactive dashboards for visualization and monitoring of key indicators.",
      "Automated processes using digital tools to improve operational efficiency."
    ],
    "itSupportAssistant": "IT Support Assistant",
    "apr2022May2023": "April 2022 – May 2023",
    "ambientalLogistica": "Ambiental & Logística San Juan SAS, Pasto - Nariño, Colombia",
    "itSupportDuties": [
      "Performed maintenance and support for computer equipment, ensuring proper functioning of the technology infrastructure.",
      "Diagnosed and resolved hardware and software incidents, providing timely assistance to users.",
      "Configured and managed local networks, including installation and updating of communication devices.",
      "Managed user accounts and permissions in internal systems to ensure operational security.",
      "Assisted in the implementation and updating of operating systems and applications in collaboration with the Systems Engineering department."
    ],
    "itSupportAuxiliary": "IT Support Auxiliary",
    "feb2021Aug2021": "February 2021 – August 2021",
    "foundationCangagua": "Cangagua Foundation, Guadalajara de Buga, Valle del Cauca, Colombia",
    "auxiliaryDuties": [
      "Prepared basic reports of incidents and support requests.",
      "Recorded and documented failures and technical requirements presented by users.",
      "Used computer tools (Excel) for tracking and controlling incidents.",
      "Performed preventive and corrective maintenance on equipment and systems under supervision.",
      "Provided attention and technical support to users in the installation, configuration, and updating of software and hardware."
    ],
    "googleITSupport": "Google IT Support Certificate",
    "googleDataAnalytics": "Google Data Analytics Certificate",
    "googleAIEssentials": "Google AI Essentials",
    "viewCertificate": "View Certificate",
    "dec2024": "December 2024",
    "programmingLanguages": "Programming Languages",
    "webDevelopment": "Web Development",
    "databases": "Databases",
    "itSupport": "IT Support",
    "toolsAndTech": "Tools and Technologies",
    "dataAnalysis": "Data Analysis",
    "cybersecurity": "Cybersecurity and Data Protection",
    "additionalSkillsList": [
      "Effective communication",
      "Teamwork",
      "Proactivity",
      "Continuous learning",
      "Leadership potential",
      "Attention to detail",
      "Incident management",
      "Error resolution"
    ],
    "copyright": "© 2025 Michael Felipe Corrales Flórez. All rights reserved.",
    "backToTop": "↑"
  }