{
    "title": "Michael Felipe Corrales Flórez - Portafolio",
    "name": "Michael Felipe Corrales Flórez",
    "profession": "Ingeniero de Sistemas",
    "email": "📧 mfcorrales26@gmail.com",
    "phone": "📱 310 622 6041",
    "linkedin": "🔗 LinkedIn",
    "portfolio": "🌐 Portafolio",
    "github": "💻 GitHub",
    "downloadCV": "📄 Descargar CV",
    "intro": "Soy Ingeniero de Sistemas con experiencia en desarrollo web, análisis de datos y ciberseguridad. Me especializo en transformar datos en información valiosa mediante procesos ETL, automatización y visualización de datos con dashboards interactivos. Tengo conocimientos en el desarrollo de aplicaciones web utilizando tecnologías como React, Node.js, y Vue.js, además del manejo de bases de datos relacionales y no relacionales (PostgreSQL, MySQL, SQL avanzado), incluyendo modelado, consultas avanzadas y el uso de triggers. Cuento con experiencia en la implementación de sistemas de control y seguridad informática, así como en la protección de datos personales, capacitando a equipos y optimizando procesos para mitigar riesgos. Además, poseo habilidades en el uso de herramientas de desarrollo como Git y GitHub para el control de versiones y gestión de repositorios.",
    "education": "Educación",
    "experience": "Experiencia Profesional",
    "certifications": "Certificaciones",
    "technicalSkills": "Habilidades Técnicas",
    "additionalSkills": "Habilidades Adicionales",
    "systemsEngineering": "Ingeniería de Sistemas",
    "oct2024": "Octubre 2024",
    "universityPamplona": "Universidad de Pamplona, Villa del Rosario – Norte de Santander",
    "engineeringDescription": "La carrera de Ingeniería de Sistemas de la Universidad de Pamplona se enfoca en formar profesionales integrales capaces de diseñar, desarrollar e implementar soluciones tecnológicas innovadoras para resolver problemas en diversos sectores. A través de un plan de estudios actualizado y pertinente, los estudiantes adquieren conocimientos y habilidades en áreas clave como: Desarrollo de Software, Gestión de Datos, Inteligencia Artificial, Ciberseguridad.",
    "thesis": "Tesis: Lineamientos para el uso eficiente de herramientas de Inteligencia Artificial en las empresas de Colombia.",
    "dataMiningDiploma": "Diplomado en Minería de Datos Inteligente y Seguridad de Sistemas",
    "dataMiningDescription": "Forma especialistas en análisis avanzado de datos y ciberseguridad, combinando minería de datos, aprendizaje automático y protección de la información.",
    "dataProtectionDiploma": "Diplomado en Protección de Datos Personales y Ciberseguridad",
    "july2025": "Julio 2025 (10 semanas)",
    "universityJaveriana": "Universidad Javeriana de Cali, Colombia",
    "dataProtectionDescription": "Enfocado en la normatividad colombiana y la optimización de procesos para garantizar el cumplimiento en protección de datos.",
    "highSchool": "Bachillerato – Técnico en auxiliar contable",
    "nov2016": "Noviembre 2016",
    "highSchoolName": "Minuto de Dios Policarpa Salavarrieta, Cúcuta – Norte de Santander",
    "dataAnalyst": "Analista de Datos",
    "jan2024Feb2025": "Enero 2024 – Febrero 2025",
    "foundationPro": "Fundación Pro-Regiones Colombia, San Juan de Pasto, Colombia",
    "dataAnalystDuties": [
      "Creé informes y reportes estadísticos sobre los avances en procesos internos de la organización.",
      "Documenté de manera detallada cada proceso realizado, optimizando la trazabilidad de la información.",
      "Utilicé Excel y otros recursos tecnológicos avanzados para la generación de reportes.",
      "Administré y gestioné bases de datos en SQL, realizando consultas, actualizaciones y mantenimiento de la información.",
      "Diseñé y optimicé consultas en SQL para la extracción y análisis de datos.",
      "Ejecuté labores de mantenimiento preventivo y correctivo en equipos y sistemas de la empresa.",
      "Brindé soporte técnico y asistencia en la optimización de procesos tecnológicos y operativos.",
      "Creé dashboards interactivos para la visualización y seguimiento de indicadores clave.",
      "Automaticé procesos mediante herramientas digitales para mejorar la eficiencia operativa."
    ],
    "itSupportAssistant": "Asistente de Soporte TI",
    "apr2022May2023": "Abril 2022 – Mayo 2023",
    "ambientalLogistica": "Ambiental & Logística San Juan SAS, Pasto - Nariño, Colombia",
    "itSupportDuties": [
      "Realicé mantenimiento y soporte de equipos informáticos, garantizando el correcto funcionamiento del parque tecnológico.",
      "Diagnostiqué y solucioné incidencias en hardware y software, proporcionando atención oportuna a los usuarios.",
      "Configuré y administré redes locales, incluyendo la instalación y actualización de dispositivos de comunicación.",
      "Gestioné cuentas de usuario y permisos en los sistemas internos para asegurar la seguridad operativa.",
      "Asistí en la implementación y actualización de sistemas operativos y aplicaciones en colaboración con el área de Ingeniería de Sistemas."
    ],
    "itSupportAuxiliary": "Auxiliar de Soporte TI",
    "feb2021Aug2021": "Febrero 2021 – Agosto 2021",
    "foundationCangagua": "Fundación Cangagua, Guadalajara de Buga, Valle del Cauca, Colombia",
    "auxiliaryDuties": [
      "Elaboré reportes básicos de incidencias y solicitudes de soporte.",
      "Registré y documenté fallas y requerimientos técnicos presentados por los usuarios.",
      "Utilicé herramientas informáticas (Excel) para el seguimiento y control de incidencias.",
      "Ejecuté labores de mantenimiento preventivo y correctivo en equipos y sistemas bajo supervisión.",
      "Brindé atención y soporte técnico a usuarios en la instalación, configuración y actualización de software y hardware."
    ],
    "googleITSupport": "Google IT Support Certificate",
    "googleDataAnalytics": "Google Data Analytics Certificate",
    "googleAIEssentials": "Google AI Essentials",
    "viewCertificate": "Ver Certificado",
    "dec2024": "Diciembre 2024",
    "programmingLanguages": "Lenguajes de Programación",
    "webDevelopment": "Desarrollo Web",
    "databases": "Bases de Datos",
    "itSupport": "Soporte TI",
    "toolsAndTech": "Herramientas y Tecnologías",
    "dataAnalysis": "Análisis de Datos",
    "cybersecurity": "Ciberseguridad y Protección de Datos",
    "additionalSkillsList": [
      "Comunicación efectiva",
      "Trabajo en equipo",
      "Proactividad",
      "Aprendizaje constante",
      "Liderazgo potencial",
      "Atención al detalle",
      "Manejo de incidencias",
      "Solución de errores"
    ],
    "copyright": "© 2025 Michael Felipe Corrales Flórez. Todos los derechos reservados.",
    "backToTop": "↑"
  }